
        <h1>PHP</h1>
        <p>
            PHP додає наступну функціональність до HTML
        </p>
        <ul class="collection">
            <li class="collection-item">Вирази</li>
            <li class="collection-item">Інструкції</li>
            <li class="collection-item">Управління формування HTML</li>
        </ul>
        <p>
            Вирази задаються спеціальними тегами &lt;? = 2 + 3 ? &lt; = <?= 2 + 3?>
        </p>
        <p>
            <b>Інструкції</b> - блоки коду, який виконується без впливу на HTML
            Є дві форми тегів: повна <?php?> та скорочена <? ?>
            Повна працює завжди, скорочена - якщо є відповідні налаштування 
            у конфігурації сервера. Вживання скороченої форми не рекомендується.
        </p>
        <p>
            <b>Змінні</b>. Оскільки у PHP процедурна парадігма і простори імен не дуже поширені, 
            більшість слів є зарезервованими. Щоб не стрворювати конфлікти зі змінними,
            всі змінні у PHP починаються з знаку $. 
            Типізація динамична (на читання - як у JS)
        </p>  
        <?php
            $x = 30;
            $y = "20";
        ?>
        <p>
            !!! У PHP розрізняються оператори арифметичного додавання  (+) та рядкової конкатенації (.)
            <br/>
            <code>
                 x + y = <?= $x + $y ?>, x.y = <?= $x . $y ?>
                 <br/>
            </code> 
                 Ділення дробове, навіть якщо аргументи цілі:<br/> 
            <code>   
                 x / y = <?= $x/ $y ?>
            </code> <br/>
                 для одержання цілого значення використовуваються функції <br/>
            <code>
                 intval(x / y) = <?= intval($x/ $y) ?>
            </code> 
        </p>
        <p>
            <b>Управління формуванням HTML - умовна та циклічна верстка.</b>
        </p>

        <?php 
            $arr1 = [1,2,3,4,5]; // звичайний масив
            $arr2 = ['name' => 'Petrovich', "age" => 42]; # асоціативний масив 
        ?>
        <?php if( count($arr1) > 10 or false) { ?>
            <h3>У масиві більше за 10 елементів</h3>
        <?php } else { ?>
            <p>У масиві не більше ніж 10 елементів</p>
        <?php } ?>

        <?php if(isset($arr2['name']) || isset($arr2['age'])) : ?>
            <p>Є елемент 'name' = <?= $arr2['name'] ?></p>
        <?php else : ?>
            <b>Елемент 'name' не встановлено</b>
        <?php endif ?>
        
        <?php foreach( $arr1 as $element) { ?>
            <b><?= $element ?></b><br/>
        <?php } ?>

        <?php foreach( $arr2 as $key => $value) { ?>
            <b><?= $key ?>: <?= $value ?></b><br/>
        <?php } ?>


