<h1>
    Шаблонізація
</h1>

<p>
    Приведення усіх сторіно сайту до однакового вигляду. 
    Досягається (класично) двома підходами.
</p>
<ul class="collection">
    <li class="collection-item">Відокремленням спільних частин та включення їх до сторінок</li>
    <li class="collection-item">Створенням єдиного шаблону в середину якого вставляються тіла сторінок</li>
</ul>
<p>
    Відокремлення частин простіше, дозволяє більш гнучко формувати
    відмінності (на частині сторінок є лише меню чи рекламний блок,
    а на инших - немає)
</p>

<p>
    З шаблоном складніша маршрутізація, але зміни централізовані. 
    Основна ідея полягає в наступному: всі маршрути ведуть на один шаблон, який 
    аналізуючи маршрут, підбирає конкретне тіло. Створення єдиною "точки" проходження 
    запитів - це вимога "диспетчера доступу", яка диктується безпекою. 
</p>
<p>
    Реалізація - через налаштування сервера (apache).
    Створуємо в корені проекту файл <code>.htaccess</code>
    У налаштуваннях хосту (vhost) 
    <code>AllowOverride All</code> яка дозволяє приймати 
    додаткові налаштування серверу. 
</p>
